package sort; /**
 * Copyright (C) 2020-2023, Glodon Digital Supplier & Purchaser BU.
 * <p>
 * All Rights Reserved.
 */

import com.alibaba.fastjson.JSON;

import java.util.*;
import java.util.stream.Collectors;

/**
 * 类描述
 *
 * @author 沈航冉
 * @date 2023-09-21 10:27:50
 */
public class TreeMapSort {
	public static void main(String[] args) {
//		String jsonString = "[{\"bidderId\":\"00a0dc18d7304c8892d753f38d80f223\",\"bidderName\":\"投标单位11分隔符呼呼如果有惹人讨厌与与日日夜夜同样由于有嘤嘤嘤呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":1,\"totalScore\":\"-0.900\"},{\"bidderId\":\"0f42b05c729b492db46878ee1b383294\",\"bidderName\":\"投标单位10\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":2,\"totalScore\":\"-0.900\"},{\"bidderId\":\"1fb2cc7241304a15a6d117ea77dc29ff\",\"bidderName\":\"投标单位12健康科技客源好友分分合合发还有规划和呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":3,\"totalScore\":\"-0.900\"},{\"bidderId\":\"33e566633c764f8dabda4944b2dbbd2a\",\"bidderName\":\"投标单位3\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":4,\"totalScore\":\"-0.900\"},{\"bidderId\":\"3d23c43c6acd4e7891b77a442a466457\",\"bidderName\":\"投标单位6\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":5,\"totalScore\":\"-0.900\"},{\"bidderId\":\"3d4a4a8f1b9342f5a4c9406258887ea4\",\"bidderName\":\"投标单位18覆盖读后感哈哈的发个哈哈放到哥哥会更好呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":6,\"totalScore\":\"-0.900\"},{\"bidderId\":\"3d513cf14165490e9c5861b6ff41d5d7\",\"bidderName\":\"投标单位9\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":7,\"totalScore\":\"-0.900\"},{\"bidderId\":\"46c89f28b6184816aa185811a33e07b4\",\"bidderName\":\"投标单位16呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":8,\"totalScore\":\"-0.900\"},{\"bidderId\":\"46d3532d412d44579a13c35c00b97acf\",\"bidderName\":\"投标单位8呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过覆\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":9,\"totalScore\":\"-0.900\"},{\"bidderId\":\"4d61f4c2e89943be83c7cc60618da268\",\"bidderName\":\"投标单位4呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过呵\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":10,\"totalScore\":\"-0.900\"},{\"bidderId\":\"50dfb1cb837e4a51811d3aeb84d7c826\",\"bidderName\":\"投标单位19\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":11,\"totalScore\":\"-0.900\"},{\"bidderId\":\"55c394a27d5e4e11ac983db8fc5cc61f\",\"bidderName\":\"投标单位17\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":12,\"totalScore\":\"-0.900\"},{\"bidderId\":\"5bd0fa568b934eadb0a30bd202f162ef\",\"bidderName\":\"投标单位5呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈呵哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":13,\"totalScore\":\"-0.900\"},{\"bidderId\":\"9f2c790b061d414d9b29d6275d2aecf8\",\"bidderName\":\"投标单位14更好恢复方法打分丰田婷婷大大方方天天给他吧嘀嘀咕咕呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":14,\"totalScore\":\"-0.900\"},{\"bidderId\":\"af98bcf3b6d44f26b5828dde1c1521fa\",\"bidderName\":\"投标单位2\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":15,\"totalScore\":\"-0.900\"},{\"bidderId\":\"c0d657029a614d6eb937460c809c9e97\",\"bidderName\":\"投标单位15个哈哈哈飒飒独孤皇后独孤皇后都很好时候孤鸿寡鹄独孤皇后是各行各业上位规划非官方个呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":16,\"totalScore\":\"-0.900\"},{\"bidderId\":\"cf754ec1e73a4617a48e3f9e93c9ffd0\",\"bidderName\":\"投标单位13规划局将发放歌霍建华和聚集解决方法呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":17,\"totalScore\":\"-0.900\"},{\"bidderId\":\"ea4e2e02471c4e17a5fcb57e9263cd8b\",\"bidderName\":\"投标单位7\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":18,\"totalScore\":\"-0.900\"},{\"bidderId\":\"f6c04c0bcd5b45cb9502161ce931d0fc\",\"bidderName\":\"投标单位20\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":19,\"totalScore\":\"-0.900\"},{\"bidderId\":\"f7135c4cd81a4bb88196b54c4dcdb5a2\",\"bidderName\":\"投标单位22大厦的法规规划的共和国打广告呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":20,\"totalScore\":\"-0.900\"},{\"bidderId\":\"f7b70178ca644d1b91ce71dcddbfd76d\",\"bidderName\":\"投标单位21呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过过的灌灌灌灌过过过过过过过过过过过过过过发广告滚滚滚过过过过过发个哈哈哈或错肥肥肥肥过非官方的的共同呵呵哈哈哈拖若晕或拖分隔符付付付付付付付付付付付发广告滚滚滚过过过过过过\",\"colName\":\"分部分项工程清单得分\",\"indexNo\":21,\"totalScore\":\"-0.900\"}]";
//		System.out.println(jsonString);
//		List<EvalQuotationRationalityModel> list = JSON.parseArray(jsonString, EvalQuotationRationalityModel.class);
//		System.out.println("==========================================");
//		List<EvalQuotationRationalityModel> reportList = new ArrayList<>();
//		Map<String, List<EvalQuotationRationalityModel>> listMap = list.stream().collect(Collectors.groupingBy(EvalQuotationRationalityModel::getBidderId));
//		TreeMap<String, List<EvalQuotationRationalityModel>> treeMap = new TreeMap<>(listMap);
//		List<Map.Entry<String, List<EvalQuotationRationalityModel>>> entries = new ArrayList<>(treeMap.entrySet());
//		Collections.sort(entries, Comparator.comparing(o -> o.getValue().get(0).getBidderName()));
//		int curCount = 1;
//		for (Map.Entry<String, List<EvalQuotationRationalityModel>> entry : treeMap.entrySet()) {
//			List<EvalQuotationRationalityModel> valueList = entry.getValue();
//			int finalCurCount = curCount;
//			valueList.forEach(value->{
//				value.setIndexNo(finalCurCount);
//				reportList.add(value);
//			});
//			curCount++;
//		}
//		System.out.println(JSON.toJSONString(reportList));
		System.out.println("==========================================");

		TreeMap<String,String> tm = new TreeMap<>();
		tm.put("aaa","投标单位11");
		tm.put("bbb","投标单位10");
		ArrayList<Map.Entry<String, String>> entries1 = new ArrayList<>(tm.entrySet());
		Collections.sort(entries1, Map.Entry.comparingByValue());
		for (Map.Entry<String, String> stringStringEntry : tm.entrySet()) {
			System.out.println(stringStringEntry);
		}

		System.out.println();
	}
}